# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameterSet..::..Erase Method
FamilyParameterSet Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	FamilyParameter item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As FamilyParameter _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	FamilyParameter^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..FamilyParameter
# See Also
FamilyParameterSet Class
Autodesk.Revit.DB Namespace